app/Http/Controllers/CategoryController.php

select * from `categories`
---
    public function index()
    {
        //Category::all();
        return CategoryResource::collection(Category::all());