app/Http/Controllers/RecordController.php

    public function index()
    {
        return RecordResource::collection(Record::all());
---
select * from `records`